Revit 2026 API

# BuiltInFailuresSectionViewFailures Class

---

Failures about Section.

SystemObject Autodesk.Revit.DBBuiltInFailuresSectionViewFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SectionViewFailures
```
```vb
Public NotInheritable Class SectionViewFailures
```
```cpp
public ref class SectionViewFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SectionViewFailures = class end
```

The BuiltInFailuresSectionViewFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScopeBoxBehindSection | Section may not be associated to a scope box which lies behind it. |

#### Reference

Autodesk.Revit.DB Namespace